-- 회원 테이블에 관리자 계정 1번으로
INSERT INTO member (username, user_id, password, authority)
VALUES ('admin', 'admin0000', '$2a$10$Naqxf0wgmdyA9Q4YHZaeM.Fwwp14ZlN3YOfwY92Gi9v9NQyEQ/yj.', 'ROLE_ADMIN');

-- 회원 테이블에 사용자 테스트 계정 2번으로
INSERT INTO member (username, user_id, password, authority)
VALUES ('test', 'test0000', '$2a$10$Naqxf0wgmdyA9Q4YHZaeM.Fwwp14ZlN3YOfwY92Gi9v9NQyEQ/yj.', 'ROLE_USER');

-- 대직무분야코드 데이터 집어넣기
-- 빠진거 1, 3, 5, 11
INSERT INTO major_job_code(code, job_name)
VALUES ('1','사업관리'),
       ('2','경영.회계.사무'),
       ('3','금융.보험'),
       ('4','교육.자연.과학.사회과학'),
       ('5','법률.경찰.소방.교도.국방'),
       ('6','보건.의료'),
       ('7','사회복지.종교'),
       ('8','문화.예술.디자인.방송'),
       ('9','운전.운송'),
       ('10','영업.판매'),
       ('11','경비.청소'),
       ('12','이용.숙박.여행.오락.스포츠'),
       ('13','음식서비스'),
       ('14','건설'),
       ('15','광업자원'),
       ('16','기계'),
       ('17','재료'),
       ('18','화학'),
       ('19','섬유.의복'),
       ('20','전기.전자'),
       ('21','정보통신'),
       ('22','식품.가공'),
       ('23','인쇄.목재.가구.공예'),
       ('24','농림어업'),
       ('25','안전관리'),
       ('26','환경.에너지');

-- 게시판 생성
INSERT INTO board(code, board_name)
VALUES ('1','사업관리'),
       ('2','경영.회계.사무'),
       ('3','금융.보험'),
       ('4','교육.자연.과학.사회과학'),
       ('5','법률.경찰.소방.교도.국방'),
       ('6','보건.의료'),
       ('7','사회복지.종교'),
       ('8','문화.예술.디자인.방송'),
       ('9','운전.운송'),
       ('10','영업.판매'),
       ('11','경비.청소'),
       ('12','이용.숙박.여행.오락.스포츠'),
       ('13','음식서비스'),
       ('14','건설'),
       ('15','광업자원'),
       ('16','기계'),
       ('17','재료'),
       ('18','화학'),
       ('19','섬유.의복'),
       ('20','전기.전자'),
       ('21','정보통신'),
       ('22','식품.가공'),
       ('23','인쇄.목재.가구.공예'),
       ('24','농림어업'),
       ('25','안전관리'),
       ('26','환경.에너지');

INSERT INTO article(body, reg_date, title, board_id, member_id)
VALUES ('2024년에는 취업할 수 있을까요.. 명절날 고향 가기가 눈치보입니다.. 다들 힘들지만 항상 화이탕압나다', '20231210', '취업이 막막합니다....', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '2024 시험 준비하는 분 계시나요?', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '자격증 스터디원 구합니다', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '이거 준비기간 몇 개월이 적당함?', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '종강하고싶다', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '좋은 아침입니다', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '올해도 다 갔네요', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '비전공자 도와주세요', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '2024년에 꼭 취업하고 싶습니다', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '자격증 취득한 선배님 계십니까', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '인생이 쓰다', 1, 2),
       ('아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말아무말', '20231210', '종강하고 싶다', 1, 2);

INSERT INTO comment(body, reg_date, article_id, member_id)
VALUES ('어쩔저쩔', '20231210', 1, 2),
       ('test용입니다123ㄱㄹㅈG', '20231210', 1, 2),
       ('test용입니다adfhgasdfhareha', '20231210', 1, 2);

INSERT INTO banner(major_job_code, host, cert_name, major_job_name, overview, cert_info_id)
VALUES ('25','한국산업인력공단', '산업안전기사', '안전관리', '생산관리에서 안전을 제외하고는 생산성 향상이 불가능하다는 인식속에서 산업현장의 근 로자를 보호하고 근로자들이 안심하고 생산성 향상에 주력할 수 있는 작업환경을 만들 기위하여 전문적인 지식을 가진 기술인력을 양성하고자 자격제도제정.', '68'),
       ('20','한국산업인력공단', '전기기사', '전기.전자', '전기를 합리적으로 사용하는 것은 전력부문의 투자효율성을 높이는 것은 물론 국가 경제의 효율성 측면에도 중요하다. 하지만 자칫 전기를 소홀하게 다룰 경우 큰 사고의 위험이 있기 때문에 전기설비의 운전 및 조작·유지·보수에 관한 전문 자격제도를 실시하여 전기로 인한 재해를 방지하고 안전성을 높이고자 자격제도를 제정하였다.', '78'),
       ('21','한국산업인력공단', '정보처리기사', '정보통신', '컴퓨터를 효과적으로 활용하기 위해서 하드웨어뿐만 아니라 정교한 소프트웨어가 필요하다. 이에 따라 우수한 프로그램을 개발하여 업무의 효율성을 높이고, 궁극적으로 국가발전에 이바지하기 위해서 컴퓨터에 관한 전문적인 지식과 기술을 갖춘 사람을 양성할 목적으로 제정됨.', '93'),
       ('25','한국산업인력공단', '건설안전기사', '안전관리', '건설재해예방계획 수립, 작업환경의 점검 및 개선, 유해 위험방지 등의 안전에 관한 기 술적인 사항을 관리하며 건설물이나 설비작업의 위험에 따른 응급조치, 안전장치 및 보 호구의 정기점검, 정비 등의 직무 수행.', '65'),
       ('25','한국산업인력공단', '소방설비기사(전기분야)', '안전관리', '건물이 점차 대형화, 고층화, 밀집화되어 감에 따라 화재발생시 진화보다는 화재의 예방 과 초기진압에 중점을 둠으로써 국민의 생명, 신체 및 재산을 보호하는 방법이 더 효과 적인 방법이다. 이에 따라 소방설비에 대한 전문인력을 양성하기 위하여 자격제도 제정.', '71');
